[
  {
    "id": 1,
    "title": "Kasa",
    "image": "/images/kasa_miniat.webp",
    "descriptionImage": "/images/kasa.webp",
    "github": "https://github.com/YoDaMned59/kasa.git",
    "site": "https://openclassrooms-kasa-app.netlify.app/",
    "description": "Kasa est une application moderne permettant aux utilisateurs de trouver des logements en location saisonnière. Ce projet met en avant la gestion des routes avec React Router, la communication avec une API REST, et l'optimisation des composants React via PropTypes. Une attention particulière a été portée à l'accessibilité et à la responsivité avec CSS Grid et SCSS.",
    "skills": "React, JavaScript ES6, API REST, React Router, PropTypes, CSS Grid, SCSS, Responsivité, Accessibilité"
  },
  {
    "id": 2,
    "title": "Ohmyfood",
    "image": "/images/ohmyfood_miniat.webp",
    "descriptionImage": "/images/ohmyfood.webp",
    "github": "https://github.com/YoDaMned59/Ohmyfood.git",
    "site": "https://yodamned59.github.io/Ohmyfood/",
    "description": "Ohmyfood est une application web dynamique permettant aux utilisateurs de précommander des plats dans des restaurants partenaires. Ce projet se concentre sur les animations CSS avancées pour enrichir l'expérience utilisateur, avec des effets fluides et interactifs. Une structure SCSS optimisée a été mise en place pour garantir un code maintenable et évolutif.",
    "skills": "HTML5, CSS3, SCSS, JavaScript, Flexbox, Animations CSS, Responsivité, Accessibilité"
  },
  {
    "id": 3,
    "title": "724 events",
    "image": "/images/724-event_miniat.webp",
    "descriptionImage": "/images/724-event.webp",
    "github": "https://github.com/YoDaMned59/Debuggez-une-application-React.JS-main.git",
    "site": "https://724events-ac.vercel.app/",
    "description": "724 Events est une plateforme permettant d'organiser et gérer des événements. Ce projet met l'accent sur le debugging d'une application React existante en identifiant et corrigeant des erreurs via Chrome DevTools et les outils de développement React. La gestion des états et des API a également été optimisée avec les Hooks et React Router.",
    "skills": "React, JavaScript, Debugging, API intégration, React Router, Hooks, Console DevTools, Chrome DevTools"
  },
  {
    "id": 4,
    "title": "ArgentBank",
    "image": "/images/argentbank_miniat.webp",
    "descriptionImage": "/images/argentbank.webp",
    "github": "https://github.com/YoDaMned59/ArgentBank-Frontend.git",
    "site": "https://artfish.pro/portfolio/argentbank/",
    "description": "ArgentBank est une application bancaire sécurisée permettant aux utilisateurs de gérer leurs comptes. Ce projet met en œuvre Redux pour la gestion de l'état global, une authentification sécurisée via JWT, et une architecture modulaire avec React. L'optimisation UX/UI a été priorisée pour garantir une expérience utilisateur fluide et intuitive.",
    "skills": "React, Redux, JavaScript ES6, API REST, Authentification JWT, UI/UX, SCSS, Accessibilité, React Router"
  },
  {
    "id": 5,
    "title": "Nina Carducci",
    "image": "/images/nina-carducci_miniat.webp",
    "descriptionImage": "/images/nina-carducci.webp",
    "github": "https://github.com/YoDaMned59/nina-carducci.github.io-master.git",
    "site": "https://yodamned59.github.io/nina-carducci.github.io-master/",
    "description": "Niona Carducci est un site vitrine mettant en avant le travail d'une artiste peintre. Ce projet se concentre sur l'optimisation des performances web, le référencement SEO, et une expérience utilisateur immersive avec des animations et une navigation fluide.",
    "skills": "HTML5, CSS3, SCSS, JavaScript, SEO, Optimisation des performances, Animations CSS, Accessibilité"
  }
]
